Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་སྐུ་དེ་ཅི་འདྲ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་སྐུ་ནི་བརྟན་པ། སྲ་བ། མི་ཤིགས་པ། རྡོ་རྗེའི་སྐུ། འཆི་འཕོ་མེད་པ། མི་སྐྱེ་བ་སྟེ། དེ་ནི་སྐུ་ཐ་དད་པས་འདུལ་བ་སེམས་ཅན་རྣམས་ཀྱི་འདུལ་བའི་དབང་གིས་ཐ་དད་དུ་འགྱུར་ཡང་མེས་མི་འཚིག །མཚོན་གྱིས་མི་ཚུགས་ཏེ། རྡོ་རྗེ་ལྟ་བུར་བརྟན་པ། མི་ཤིགས་པ་ཡིན་ནོ། །
en: The Lord answered, “Śāriputra, the bodhisatva’s Dharma body is firm, solid, and unbreakable, a vajra body, undying, and unborn. He may let it come into harm’s way when he is using it to train those sentient beings who are receptive to the training, but it can be neither burned by fire nor harmed by weapons. It is firm like a vajra and cannot be broken.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྐུ་ལ་གནས་པ། བརྩོན་འགྲུས་མ་ཉམས་པ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ལྷུན་གྱིས་གྲུབ་པར་སྤྱོད་ཅིང་ལུས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་ཀྱང་སེམས་པ་མེད། ཡོངས་སུ་རྟོག་པ་མེད་དེ། ལུས་དབེན་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་ཤེས་སོ། ། ལུས་དབེན་པའི་མཚན་ཉིད་ཀྱིས་ཀྱང་ཆོས་ཐམས་ཅད་དབེན་པའི་མཚན་ཉིད་རྗེས་སུ་ཤེས་ལ། ལུས་དབེན་པའི་མཚན་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་དབེན་པའི་མཚན་ཉིད་ལ་གཉིས་སུ་ཡང་མི་བྱེད་དེ། མཚན་ཉིད་གང་ལུས་དབེན་པའི་མཚན་ཉིད་ཡིན་པའི་མཚན་ཉིད་དེ་ནི་ཆོས་ཐམས་ཅད་དབེན་པའི་མཚན་ཉིད་དེ་དབེན་པའི་མཚན་ཉིད་གཅིག་གིས་རྗེས་སུ་འཇུག་གོ ། ནང་གི་ཆོས་མི་དམིགས་པའི་ཕྱིར་རང་གི་ལུས་དབེན་པའི་མཚན་ཉིད་ཀྱིས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དབེན་པའི་མཚན་ཉིད་དུ་མཉམ་པར་བྱེད་དོ། ། དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དབེན་པའི་མཚན་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་དབེན་པའི་མཚན་ཉིད་ཀྱིས་རྗེས་སུ་ཤེས། ཆོས་ཀྱི་དབྱིངས་དབེན་པའི་མཚན་ཉིད་ཀྱང་ཆོས་ཐམས་ཅད་དབེན་པའི་མཚན་ཉིད་ཀྱིས་རྗེས་སུ་སློབ་སྟེ། དེ་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་སེམས་ཅན་གྱི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་རྗེས་སུ་ཤེས་སོ། ། དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་རྗེས་སུ་ཤེས་སོ། ། རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་རྗེས་སུ་ཤེས་སོ། ། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་རྗེས་སུ་ཤེས་སོ། ། རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་རྗེས་སུ་ཤེས་སོ། ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་རྗེས་སུ་ཤེས་སོ། ། རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་རྗེས་སུ་ཤེས་སོ། ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་ཀྱིས་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་རྗེས་སུ་ཤེས་ཏེ། འདས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་མ་འོངས་པའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད། འདས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་འདས་པའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད། མ་འོངས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་འདས་པའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད། འདས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་མ་འོངས་པའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད། མ་འོངས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་མ་འོངས་པའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད། མ་འོངས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་འདས་པའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད། འདས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་ཀྱང་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་འགལ་བར་མི་བྱེད་དེ།
en: In this way, Śāriputra, the bodhisatva whose vigor is unyielding and whose mastery of the Dharma body is effortless uses his body to bring sentient beings to maturity when he practices the perfection of vigor. He does so without deliberating about it, and without assumptions. He understands that the body is characterized by separateness. From the fact that the body is characterized by separateness, he understands that all phenomena are characterized by separateness. Because of this, he makes no distinction between the fact that the body is characterized by separateness and the fact that all phenomena are characterized by separateness. Whatever characterizes the fact that the body is characterized by separateness also characterizes the fact that all phenomena are characterized by separateness, and he takes these to be the very same characteristics of separateness. The fact that one’s own body is characterized by separateness is the very same as the fact that the bodies of all sentient beings are characterized by separateness. He understands the fact that the bodies of all sentient beings are characterized by separateness being the same as the fact that the totality of phenomena is characterized by separateness, and he trains in the fact that the totality of phenomena is characterized by separateness is the same as the fact that all phenomena are characterized by separateness. This is because there are no internal phenomena that can be established. He realizes that the suchness of his own body is the suchness of the bodies of sentient beings, and he realizes that the suchness of the body of all sentient beings is the suchness of his own body. He realizes that the suchness of his own body is the suchness of all the buddhas, and he realizes that the suchness of all the buddhas is the suchness of his own body. He realizes that the suchness of his own body is the suchness of the past, the future, and the present. He realizes that the suchness of the past, the future, and the present is the suchness of his own body. The suchness of the past is not at variance with the suchness of the future. The suchness of the past is not at variance with the suchness of the present. The suchness of the present is not at variance with the suchness of the past. The suchness of the future is not at variance with the suchness of the past. The suchness of the past is not at variance with the suchness of the future. The suchness of the future is not at variance with the suchness of the present. The suchness of the present is not at variance with the suchness of the future. The suchness of the future is not at variance with the suchness of the present, and the suchness of the present is not at variance with the suchness of the past. The suchness of the past is not at variance with the suchness of the present.

source: ཡང་འདས་པའི་དེ་བཞིན་ཉིད་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་དེ་བཞིན་ཉིད་དོ། ། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་ཀུན་ནས་ཉོན་མོངས་པ་དང་རྣམ་པར་བྱང་བའི་དེ་བཞིན་ཉིད་དོ། ། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་མྱ་ངན་ལས་འདས་པ་དང་འཁོར་བའི་དེ་བཞིན་ཉིད་དོ། ། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་མངོན་པར་འདུ་བྱེད་པའི་དེ་བཞིན་ཉིད་དོ། ། མངོན་པར་འདུ་བྱེད་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་དེ་བཞིན་ཉིད་ཡིན་ཏེ།
en: “What is true of the suchness of the past, the future, and the present is also true of the suchness of the skandhas, the elements, and the sense fields. What is true of the suchness of the skandhas, the elements, and the sense fields is also true of the suchness of the corruptions and their purification. What is true of the suchness of the corruptions and their purification is also true of the suchness of nirvāṇa and saṃsāra. What is true of the suchness of saṃsāra and nirvāṇa is also true of the suchness of constructions. The essence of the suchness of constructions is the same as that of all conditioned things.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ནི་དེ་ཁོ་ནའོ། ། དེ་བཞིན་ཉིད་དོ། ། གཞན་མ་ཡིན་པ་ཉིད་དོ། ། བྲལ་བ་མེད་པའོ། ། ལུས་མེད་པའོ། ། དེ་བཞིན་ཉིད་ལ་ནི་ལུས་གང་ཡང་མེད་དེ། ལུས་མེད་པའི་དེ་བཞིན་ཉིད་དོ། ། དེ་བས་ན་དེ་བཞིན་གཤེགས་པའི་ལུས་ཞེས་བྱའོ། ། དེའི་ཕྱིར་འདི་ནི་དེ་བཞིན་ཉིད་ཀྱི་ལུས་ཏེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ལུས་ཞེས་བྱའོ། ། ལུས་དེ་ལྟ་བུ་ནི་ལུས་ཐམས་ཅད་དེ། དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ཐམས་ཅད་ཀྱང་སྟོན་ལ་དེ་བཞིན་གཤེགས་པའི་ལུས་ཀྱང་མི་བྱེད་དེ། ལུས་མེད་པ་རྩོད་པ་མེད་པས་གཟུགས་ཀྱི་ལུས་ཐམས་ཅད་ཀྱང་སྟོན་ལ་དེ་བཞིན་གཤེགས་པའི་ལུས་ཀྱང་འཁྲུགས་པར་མི་བྱེད་དོ། ། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་སོ་སོར་རྟོག་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་མཉམ་པ་ཉིད་ཀྱིས་ཀྱང་རང་གི་ལུས་མཉམ་པ་ཉིད་སོ་སོར་རྟོག་གོ ། རང་གི་ལུས་མཉམ་པ་ཉིད་ཀྱིས་ལུས་དང་། ལུས་མེད་པ་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་སོ་སོར་རྟོག་གོ ། ལུས་དང་ལུས་མེད་པ་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཀྱིས་ཤིན་ཏུ་ལུས་མེད་པའི་ལུས་སུ་མཐོང་ངོ་། ། ལུས་ཐམས་ཅད་རྟེན་ཅིང་འབྲེལ་ཏེ་བྱུང་བར་ཡང་ཤེས་སོ། ། ཤེས་ནས་ཀྱང་ཆོས་ཀྱི་སྐུ་མངོན་པར་སྒྲུབ་བོ། །དེ་ཆོས་ཀྱི་སྐུ་མངོན་པར་བསྒྲུབས་ནས། ཆོས་ཀྱི་སྐུ་ཉིད་ཡིན་གྱི། ཕུང་པོ་དང་ཁམས་དང་། སྐྱེ་མཆེད་ལུས་ནི་མ་ཡིན་ནོ། ། དེ་ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བས་མཐོང་བས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ་ལོ། ། ཐོས་པས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ་ལོ། ། རེག་པས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ་ལོ། ། སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ། །
en: “Śāriputra, suchness implies thatness and thusness, and being nothing other than what it is; it is inalienable and unembodied. Suchness is not in any way embodied—the unembodied is suchness. This is the embodiment of the tathāgata. Therefore, the very embodiment of suchness is what is meant by the embodiment of the tathāgata. Such an embodiment is an all-encompassing embodiment. The bodhisatva displays everything as being embodied, but he does not make the tathāgata into something that is embodied, and being unembodied and undisputed, he displays all embodied forms while not infringing upon the embodiment of the tathāgata. Through the knowledge of the tathāgata he discerns the embodiment of a tathāgata. Through the sameness of a tathāgata body he discerns the sameness of his own body. Through the sameness of his own body he discerns the sameness of all things embodied and all things not embodied. Through the sameness of all things embodied and not embodied he sees the final lack of any body. This is the understanding of the dependently originated nature of all bodies, and when he sees this, he attains the Dharma body. Having attained the Dharma body, he becomes the Dharma body himself, and he no longer has a body consisting of skandhas, elements, and sense fields. Someone who manifests the Dharma body can train sentient beings by means of sight. He can train sentient beings by means of sound. He can train sentient beings by means of physical contact. He can be of benefit to sentient beings.

source: ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་སྨན་པའི་རྒྱལ་པོ་གསོ་བྱེད་ཀྱིས་རྩི་ཐམས་ཅད་བསྡུས་ནས་ རྩིའི་ཤིང་མང་པོ་སྦྱར་བ་ལས་བུ་མོ་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་ སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པའི་མཆོག་དང་ལྡན་པ། ཤིན་ཏུ་རྫོགས་པར་ཟིན་པ། ཕྱི་བདར་བྱས་པ་ཞིག་བྱས་ནས་ དེར་འོང་བ་དང་། འགྲོ་བ་དང་། འགྲེང་བ་དང་། འདུག་པ་དང་། ཉལ་བར་བྱེད་ཀྱང་མི་རྟོག ། རྣམ་པར་མི་རྟོག་མོད་ཀྱི་བྱ་བ་དེ་དག་ཀྱང་སྟོན་ཏོ། ། དེ་ན་རྒྱལ་པོ་འམ། རྒྱལ་བུ་འམ། རྒྱལ་པོའི་བློན་པོ་ཆེན་པོའམ། ཚོང་དཔོན་ནམ། ཁྱིམ་བདག་གམ། མཁར་གྱི་རྒྱལ་པོ་འང་རུང་སྟེ། གང་ན་བ་ཆེན་པོ་ཆེ་བ་དེ་དག་འོངས་ན་ དེ་དག་ལ་སྨན་པའི་རྒྱལ་པོ་གསོ་བྱེད་ཀྱིས། སྨན་གྱི་བུ་མོ་དེ་དང་སྤྲད་པ་དང་། ཕྲད་མ་ཐག་ཏུ་ནད་ཐམས་ཅད་ཐུབ་པར་འགྱུར། མི་ན་བར་འགྱུར་ཏེ། གྱུར་པ་མེད་ཅིང་བདེ་བར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་སྨན་པའི་རྒྱལ་པོ་གསོ་བྱེད་འཇིག་རྟེན་གྱི་ནད་གསོ་བ་ཤེས་པ་དེ་ལྟར་སྨན་པ་གཞན་དག་ལ་མེད་དོ། །
en: “Take the example, Śāriputra, of Jīvaka, the king of physicians, who gathered together all kinds of medicinal substances, crushed them up, and mixed the medicinal herbs together to create a maiden who was delightful, pleasant, attractive, and in possession of many features of great beauty, fully perfected, and perfectly immaculate. She came and went, stood, sat, and slept, and although it was unbelievable and could not be fathomed, it nonetheless was apparent. A great many very sick people arrived: kings, princes, important ministers of the king, businessmen, householders, and local rulers. Jīvaka, the king of physicians, then joined them with his medicinal maiden, and as soon as they joined with her they overcame their illnesses and became well again, gaining long-lasting health. Thus, Śāriputra, the king of physicians, Jīvaka, possessed worldly knowledge of how to cure illness like that of no other doctor.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྐུས་ཕྱེ་བ་ཡང་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་སེམས་ཅན་ཇི་སྙེད་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་གདུངས་པ་རྣམས་ཀྱིས་རེག་ན་ དེ་དག་རེག་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་སྔོན་གྱི་སྨོན་ལམ་ཤིན་ཏུ་ཡོངས་སུ་དག་པས་ནད་ཐམས་ཅད་བྱང་ཞིང་གདུང་བ་ཡང་མེད་པར་འགྱུར་རོ། །
en: “In the same way, Śāriputra, when all the many sentient beings—women and men, boys and girls—who are afflicted by desire, anger, and confusion come into contact with the body of a bodhisatva who manifests the Dharma body, they will overcome all their illnesses and become free from afflictions as soon as they come into contact with it. This happens because of the completely pure aspirations the bodhisatva has made in the past.

source: ཤཱ་རིའི་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་ལུས་ཅན་གྱི་ལུས་ནི་ཟས་དང་སྐོམ་གྱིས་གསོ་བ་མ་ཡིན། ཟས་ཁམ་གྱིས་ཟ་བས་ལུས་གསོ་བ་མ་ཡིན་གྱི་དེ་ཁ་ཟས་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་ཟས་ཟའོ། ། དེ་ཟས་ཟ་ཡང་གཏོང་བར་མི་བྱེད་དོ། ། ཟས་ཟ་ཡང་ལུས་ཀྱི་ནང་དུ་གཏོང་བར་མི་བྱེད་དོ། ། ཆོས་ཀྱི་སྐུའི་སྟོབས་ལས་ཀྱང་མི་ཉམས། ཡོངས་སུ་མི་ཉམས་སོ། །
en: “Śāriputra, the body of the bodhisatva who possesses a Dharma body does not need to be sustained by food and drink. Still, although he does not have to take nourishment to maintain his body, he knows how to do so, and so he will eat out of concern for all sentient beings. He eats and does not let anything go to waste. He eats, but the food does not enter his body. The powers of his Dharma body do not deteriorate. They do not diminish.

source: ཤཱ་རིའི་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་ལུས་ཅན་ལ་ཚེ་དང་འཆི་འཕོ་དང་སྐྱེ་བ་ཡང་མེད་ལ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འཆི་འཕོ་དང་སྐྱེ་བ་ཡང་སྟོན་ཏོ། དེ་འཆི་འཕོ་ཡང་ཆོས་ཐམས་ཅད་འཆི་འཕོ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མ་ཡིན་རབ་ཏུ་ཤེས་སོ། ། སྐྱེ་ཡང་ཆོས་ཐམས་ཅད་འཕོ་བ་མེད་པར་རབ་ཏུ་ཤེས་སོ། ། འབྱུང་ཡང་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པས་རབ་ཏུ་ཤེས་སོ། ། དེ་ཆོས་ཀྱི་ལུས་དང་། ཆོས་ཀྱི་ཟས་དང་། ཆོས་ཀྱི་སྟོབས་དང་། ཆོས་ལ་སྟོན་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྔོན་གྱི་སྨོན་ལམ་ལྷུན་གྱིས་གྲུབ་པས་བརྩོན་འགྲུས་མ་ཉམས་པར་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “Śāriputra, the bodhisatva who has a Dharma body knows no life, no death, and no birth. Still, he will manifest death and rebirth in order to bring sentient beings to maturity. Although he dies, he knows that all phenomena are undying and unconditioned. Although he is born, he knows that no phenomena are transferred. Although he is born, he knows that no phenomena are born. With a Dharma body, with the food of the Dharma, the power of the Dharma, and relying on the Dharma, he effortlessly practices the perfection of vigor with unyielding vigor in accordance with the vows he made in the past, in order to bring sentient beings to maturity.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དེ་ཉིད་རྒྱས་པར་བསྟན་པའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: Then, in order to clarify this point, the Lord spoke these verses:

source: དེ་དག་ལུས་ནི་རྡོ་རྗེ་ལྟ་བུར་མི་ཤིགས་པ། འདུལ་བའི་དུས་ཤེས་ནས་ནི་ཐ་དད་སྟོན་པར་འགྱུར། །
en: “Their bodies are unbreakable like vajras, But they will allow them to be broken if they see an opportunity to train others.

source: མཚོན་གྱིས་མི་ཚུགས་མེས་ནི་ཚིག་པ་མ་ཡིན་ཡང་། །འདུལ་བའི་སེམས་ཅན་མཐོང་ནས་ཚུགས་ཤིང་མེས་ཚིག་འགྱུར། །
en: They cannot be injured by weapons or burned by fire, But when they see beings to train they will let them be injured; they will let them be burned.

source: སེམས་ཅན་ན་བ་མཐོང་ནས་སྨན་རྣམས་སུ་ཡང་འགྱུར། །
en: “They will be medicine if they see beings who are sick.

source: དེ་བཞིན་བཀྲེས་པ་རྣམས་ལ་ཟས་དང་སྐོམ་དུ་འགྱུར། །
en: They will be water and food for those who are hungry.

source: འོན་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་རྣམ་རྟོག་ཅི་ཡང་མེད། །
en: But they do not engage in conceptualization within the realm of phenomena.

source: ཆོས་ཀྱི་སྐུ་དང་ལུས་མེད་ཚུལ་གཅིག་རབ་ཏུ་འཇུག །
en: Theirs is the unified approach of the Dharma body and the lack of a body.

source: ཤེད་ལས་སྐྱེས་དང་གསོ་དང་ཤེད་ཅན་ཡོད་མིན་ཏེ། །
en: “There is no man, no growth, and no human state

source: ཆོས་སོ་ཅོག་ནི་རྟེན་ཅིང་འབྲེལ་ཏེ་བྱུང་བར་ཤེས། །
en: When all phenomena are seen to be dependently arisen.

source: གང་དེའི་རྐྱེན་ཡོད་པ་ན་སྡུག་བསྔལ་ལམ་འབྱུང་སྟེ། །
en: Whatever exists in dependence upon conditions is accompanied by suffering.

source: རྐྱེན་མེད་པན་སྡུག་བསྔལ་ལམ་ནི་འཆད་པར་འགྱུར། །
en: When conditions are undone the path of suffering is severed.

source: གཟུགས་འདི་དབུ་བ་རྡོས་པ་འདྲ་སྟེ་སྙིང་པོ་མེད། །
en: “This body is without substance, like froth.

source: ཚོར་བ་ཆུ་ཡི་ཆུ་བུར་མཚུངས་ཤིང་འདྲ་བར་སེམས། །འདུ་ཤེས་དཔྱིད་ཀྱི་དུས་ཀྱི་སྨིག་རྒྱུ་རྒྱུ་བ་འདྲ། །འདུ་བྱེད་རྣམས་ནི་ཆུ་སྐྱེས་ཤིང་དང་འདྲ་བར་ལྟ། །
en: Feelings are like bubbles appearing in the mind. Perceptions are like floating mirages during the hot season. One should see mental conditioning as being like a plantain tree.

source: ཇི་ལྟར་གར་ལ་ལྟ་བར་སྒྱུ་མ་བསླབས་པ་རྣམས། །སྐད་ཅིག་གིས་ནི་གཟུགས་རྣམས་སྣ་ཚོགས་སྟོན་བྱེད་པ། །མི་བདེན་བྱེད་པ་དེ་ལྟར་རྣམ་ཤེས་ཤེས་གྱུར་ནས
en: “A skillful magician can make various different kinds of forms Appear in an instant during his act. The deceptive creations that our consciousness experiences are just as illusory.

source: མཁས་པ་དེ་དག་ཐམས་ཅད་དུ་ཡང་སྨོན་པ་མེད། །
en: The wise never put trust in them.

source: ལོངས་སྤྱོད་རྣམས་ནི་རི་གཟར་ཆུ་དང་མཚུངས་ཤིང་འདྲ། །
en: “Possessions are like a cascading waterfall.

source: གློག་དང་མཁའ་སྤྲིན་ཕུང་པོ་ལྟ་བུར་བྱུང་ནས་མེད། །
en: Like a flash of lightning in the sky, they amount to nothing.

source: ལོངས་སྤྱོད་འགྱུར་བ་གཞུ་དྲག་འཕངས་པའི་མདའ་ལྟར་ཤེས། །
en: Seeing that fleeting possessions are like an arrow released from a bow,

source: མཁས་པ་རྣམས་ནི་ཀུན་ཏུ་ལོངས་སྤྱོད་སྨོན་པ་མེད། །
en: The wise never put trust in them.

source: ལྷ་ཡི་འཇིག་རྟེན་ལྷ་རྫས་བདེ་བ་མ་མྱོང་བ། །འཇིག་རྟེན་གསུམ་པོ་དག་ན་སེམས་ཅན་གང་ཡང་མེད། །
en: “There are no sentient beings in the threefold realm Who do not enjoy the divine pleasures of the immortal realm.

source: སླར་ཡང་སེམས་དམྱལ་སྡུག་བསྔལ་མྱོང་བ་མཐོང་གྱུར་ནས། །
en: Nonetheless, when they see those who are experiencing the suffering of the hells,

source: བདེ་གཤེགས་སྲས་པོས་དེ་མཐོང་མཐོ་རིས་འགྲོ་མི་བྱེད། །
en: The sons of the Sugata will not depart for the heavenly realms.

source: ཡིད་ནི་ནམ་མཁའ་འདྲ་བ་དེ་དག་གནས་མེད་དེ། །
en: “The mind is like space. It does not have any foundation.

source: གནས་དང་བྲལ་བ་རྣམས་ལ་འབྱུང་བ་སྲིད་མ་ཡིན། །
en: Where there is no foundation, no existence is possible.

source: འབྱུང་བ་མེད་རྣམས་སྐྱེ་དང་འཆི་འཕོ་མེད་པར་འགྱུར། །
en: Things that have no existence cannot be born or die.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆེ་བ་མི་རྒ་མི་འཆི་འཐོབ། །
en: Bodhisatvas, great beings, attain the ageless, undying state.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་མ་ཉམས་པ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་འདི་ལྟར་སློབ་སྟེ། ཀྱེ་མའོ་འཇིག་རྟེན་གནས་པ་འདི་ནི་གང་འདོད་ཆགས་ནད་ཆེན་པོར་རབ་ཏུ་མི་ཤེས། ཞེ་སྡང་ནད་ཆེན་པོར་རབ་ཏུ་མི་ཤེས། གཏི་མུག་ནད་ཆེན་པོར་རབ་ཏུ་མི་ཤེས་ཏེ། གསུམ་པོ་འདི་དག་ནད་ཆེན་པོར་རབ་ཏུ་མི་ཤེས་པའི་སྨན་པ་མི་མཁས་པ་ཤ་སྟག་གིས་ཡོངས་སུ་གང་། སྨན་པ་མི་ཤེས་པ་ཤ་སྟག་གིས་ཡོངས་སུ་གང་ནས་ནད་ཆེན་པོ་གསུམ་པོ་དེ་དག་གི་སྨན་གསུམ་མི་ཤེས་ཏེ འདོད་ཆགས་ཀྱི་ནད་ཆེན་པོའི་སྨན་ཆེན་པོ་མི་གཙང་བ་ཡིན་པར་རབ་ཏུ་མི་ཤེས། ཞེ་སྡང་གི་ནད་ཆེན་པོའི་སྨན་ཆེན་པོ་བྱམས་པ་ཡིན་པར་རབ་ཏུ་མི་ཤེས། གཏི་མུག་གི་ནད་ཆེན་པོའི་སྨན་ཆེན་པོ་རྟེན་ཅིང་འབྲེལ་ཏེ་འབྱུང་བ་ཡིན་པར་རབ་ཏུ་མི་ཤེས་ཏེ། ཀྱེ་མའོ་སྨན་པ་དེ་དག་ནི་ནད་གཞན་དང་། གཞན་དག་གསོ་ནུས་ཀྱི། ནད་ཐམས་ཅད་ནི་གསོ་བར་མི་ནུས་སོ། ། ཀྱེ་མའོ་སྨན་པ་དེ་དག་གི་སྨན་དེ་ནི་རེ་ཤིག་གསོ་ནུས་པ་ཡིན་གྱི། གཏན་དུ་གསོ་བར་བྱེད་པ་མ་ཡིན་ནོ། ། དེ་བས་ན་བདག་ཅག་གིས་ནི་སྨན་པ་དེ་དག་གི་རྗེས་སུ་བསླབ་པར་མི་བྱའི་བདག་ཅག་གིས་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས། ཆོས་ཐམས་ཅད་ལ་མཁས་པ་བླ་ན་ མེད་པ། སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ། །ནད་ཐམས་ཅད་གསོ་བར་བྱེད་པའི་རྗེས་སུ་བསླབ་པར་བྱའོ། ། བདག་ཅག་གིས་ནི་ནད་ཐམས་ཅད་གསོ་བར་བྱའི་ནད་གཞན་དང་གཞན་དག་གསོ་བར་མི་བྱ། བདག་ཅག་གིས་རེ་ཤིག་གསོ་བར་མི་བྱ་སྟེ། བདག་ཅག་གིས་གཏན་དུ་གསོ་བར་བྱེད་པ་བྱའོ། ། གང་གི་སྒྲ་ཐོས་པར་འདོད་ཆགས་ཀྱི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་འགྱུར་བ་དང་། ཞེ་སྡང་གི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་འགྱུར་བ་དང་། གཏི་མུག་གི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་ཀྱི་སྨན་དང་། རྩི་བྱུག་པའི་སྦྱོར་བ་བསྡུ་བར་བྱའོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་མ་ཉམས་པ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་དེ་བཞིན་གཤེགས་པ་སྨན་པའི་རྒྱལ་པོ་བླ་ན་ མེད་པ་ཆོས་ཐམས་ཅད་ལ་མཁས་པ་མ་གཏོགས་པར་གང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་མེད་པ་དེ་འདྲ་བའི་ཆོས་ཀྱི་སྨན་དང་རྩིས་བསྐུ་བའི་སྦྱོར་བ་སྡུད་པར་བྱེད་དེ ཆོས་ཀྱི་སྨན་དང་། རྩིས་བསྐུ་བའི་སྦྱོར་བ་དེས་ཆོས་ཀྱི་དུང་ཆེན་པོ་ལ་བསྐུས་ནས་ཡོངས་སུ་སྒྲོག་སྟེ། དེའི་སྒྲས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་མངོན་པར་གོ་བར་བྱེད་དོ། ། དེ་ནས་སེམས་ཅན་དུ་མ། སེམས་ཅན་བརྒྱ་ཕྲག་དུ་མ། སེམས་ཅན་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་བརྒྱ་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་བྱེ་བ་ཕྲག་དུ་མ། སེམས་ཅན་བྱེ་བ་བརྒྱ་ཕྲག་དུ་མ། སེམས་ཅན་བྱེ་བ་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་དཀྲིགས་ཕྲག་དུ་མ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སེམས་ཅན་རྣམས་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་འགྱུར་ཏེ།
en: “Moreover, Śāriputra, the bodhisatva whose vigor is unyielding will train in the practice of the perfection of vigor in the following way: ‘Alas. Those who are entangled in the ways of the world have no other option than to rely upon unprofessional doctors. They have no other option than to rely upon ignorant doctors who do not understand the three major forms of disease. These doctors do not understand the great disease of desire. They do not understand the great disease of anger. They do not understand the great disease of confusion. They do not understand the three kinds of medicine that these three major diseases require. They do not understand that the great disease of desire requires the great medicine of disgust. They do not understand that the great disease of anger requires the great medicine of love. They do not understand that the great disease of confusion requires the great medicine of dependent arising. Alas, these doctors are able to treat one ailment after the other, but they are not able to treat all ailments. Alas. These doctors have medicines that can treat things temporarily, but they have no ultimate remedy. This is why we will not train as doctors. Instead, we will follow the training of the lords, the buddhas, those who are skilled in the entirety of the Dharma, the unsurpassed great kings of physicians who can cure all ailments. We will develop the ability to cure all ailments, not just to cure one ailment after the other as they occur. We will develop the ability to provide the ultimate cure, not just temporary treatment. We will develop the ability to gather the kind of medicine, the kind of healing balm of the Dharma, that will heal the great ailment of desire, the great ailment of anger, and the great ailment of confusion as soon as one hears it.’ This, Śāriputra, is how the bodhisatva, the great being, practices the perfection of vigor with unyielding vigor as he gathers this medicine, this healing balm of the Dharma, which is only possessed by the tathāgatas, the unsurpassed great kings of physicians who are skilled in the entirety of the Dharma, and which is not available to any śrāvakas or pratyekabuddhas. When one applies this medicine, this healing balm of the Dharma, to the great conch of the Dharma, it fills it up, and its sound will then resound throughout the threefold thousand great thousand worlds, alleviating the great diseases of desire, anger, and confusion in many sentient beings, in many hundreds of sentient beings, in many thousands of sentient beings, in many hundreds of thousands of sentient beings, in many hundreds of thousands of millions of trillions of sentient beings, in many thousands of billions of trillions of sentient beings, and so forth—in so many sentient beings that it cannot be put into words.
